In [1]:
import pandas as pd

In [2]:
df1=pd.DataFrame()
df1

Empty DataFrame
Columns: []
Index: []

In [3]:
type(df1)

pandas.core.frame.DataFrame

In [4]:
print(df1)

Empty DataFrame
Columns: []
Index: []

In [5]:
df1.columns

Index([], dtype='object')

In [6]:
df1.index

Index([], dtype='object')

In [8]:
students_list=[['bob','william', 26,'computer engineering',86],
['emma','johnson', 23,'math',92],
['sarah','smith', 22,'chemistry',95],
['alex','brown', 21,'electricall engineering',82]]

In [9]:
students_list

[['bob', 'william', 26, 'computer engineering', 86],
 ['emma', 'johnson', 23, 'math', 92],
 ['sarah', 'smith', 22, 'chemistry', 95],
 ['alex', 'brown', 21, 'electricall engineering', 82]]

In [12]:
students_df= pd.DataFrame(students_list)
students_df

       0        1   2                        3   4
0    bob  william  26     computer engineering  86
1   emma  johnson  23                     math  92
2  sarah    smith  22                chemistry  95
3   alex    brown  21  electricall engineering  82

In [13]:
students_df= pd.DataFrame(students_list,columns=
['first name','last name','age','major','score'])
students_df

  first name last name  age                    major  score
0        bob   william   26     computer engineering     86
1       emma   johnson   23                     math     92
2      sarah     smith   22                chemistry     95
3       alex     brown   21  electricall engineering     82

In [14]:
students_df= pd.DataFrame(students_list,columns=['first name','last name','age','major','score'],
index=['name 1','name 2','name 3','name 4'])
students_df

       first name last name  age                    major  score
name 1        bob   william   26     computer engineering     86
name 2       emma   johnson   23                     math     92
name 3      sarah     smith   22                chemistry     95
name 4       alex     brown   21  electricall engineering     82

In [17]:
students_dict= {'first name':['bob','geroge','alex','fiona'],
'last name':['william', 'johnson','smith','brown'],
'age':[26,23,22,21],
'major':['computer engineering','math',
'chemistry','electrical engineering'],'score':[86,92,95,82],}
students_dict

{'first name': ['bob', 'geroge', 'alex', 'fiona'],
 'last name': ['william', 'johnson', 'smith', 'brown'],
 'age': [26, 23, 22, 21],
 'major': ['computer engineering',
  'math',
  'chemistry',
  'electrical engineering'],
 'score': [86, 92, 95, 82]}

In [30]:
students_df3=pd.DataFrame(students_dict,columns=['last name','major'])
students_df3

  last name                   major
0   william    computer engineering
1   johnson                    math
2     smith               chemistry
3     brown  electrical engineering

In [32]:
students_df

       first name last name  age                    major  score
name 1        bob   william   26     computer engineering     86
name 2       emma   johnson   23                     math     92
name 3      sarah     smith   22                chemistry     95
name 4       alex     brown   21  electricall engineering     82

In [33]:
students_df.columns

Index(['first name', 'last name', 'age', 'major', 'score'], dtype='object')

In [34]:
students_df.index

Index(['name 1', 'name 2', 'name 3', 'name 4'], dtype='object')

In [35]:
students_df.shape

(4, 5)

In [36]:
students_df.head(2)

       first name last name  age                 major  score
name 1        bob   william   26  computer engineering     86
name 2       emma   johnson   23                  math     92

In [37]:
students_df.tail(2)

       first name last name  age                    major  score
name 3      sarah     smith   22                chemistry     95
name 4       alex     brown   21  electricall engineering     82

In [41]:
students_df.describe()

TypeError: Cannot interpret '<attribute 'dtype' of 'numpy.generic' objects>' as a data type